"""
ЗАДАНИЕ
--------------------------------------------------------------------------------
Реализовать таблицу умножения от 0 до 10 включительно.
Функция принимает значение n, нужно вернуть список значений [n, n*2, n*4 ..]

нужно будет применить функцию range
"""


def multiplication_table(n: int) -> list:
    list_1 = [0]
    for i in range(1, 11):
        n = n * i
        result = list_1.append(str(n))
        n = n / i
    return result


if __name__ == '__main__':
    assert multiplication_table(5) == [0, 5, 10, 15, 20, 25, 30, 35, 40, 45, 50]
    print('Решено!')
