"""
ЗАДАНИЕ
--------------------------------------------------------------------------------
Написать функцию, которая вернет результат сложения цифр целого числа

ПРИМЕРЫ
--------------------------------------------------------------------------------
num_sum(5216) -> 14
num_sum(58716) -> 27
num_sum(321) -> 6
"""


def num_sum(numb: int) -> int:
    b = str(numb)
    list_1 = list(b)
    a = len(list_1)
    result = 0
    for i in range(0, a):
        result += int(list_1[i])
    return result


if __name__ == '__main__':
    assert num_sum(5216) == 14
    print('Решено!')
